* Introduction
* Features
* Installing

Create a virtual environment, if it already does not exist[fn:1].

#+begin_src sh
python -m venv ~/.venv/general
#+end_src

Then using pip from the virtual environment on the source code root directory.
The flag =-e= is for "editable" so one can edit the source code.

#+begin_src sh
~/.venv/general/bin/pip install -e . 
#+end_src

[fn:1] https://packaging.python.org/en/latest/tutorials/installing-packages/#creating-virtual-environments 

* How to use it
** Values module

#+begin_src sh :dir examples/values/
python=~/.venv/general/bin/python
$python -m investory.values --commodity IRBR3 --split 30:1,2023-01-25 1:3,2019-09-26
head IRBR3.ledger
#+end_src

#+RESULTS:
#+begin_example
P 2017-07-31 "IRBR3" R$21.65
P 2017-08-31 "IRBR3" R$22.18
P 2017-09-29 "IRBR3" R$22.36
P 2017-10-31 "IRBR3" R$24.26
P 2017-11-30 "IRBR3" R$25.84
P 2017-12-29 "IRBR3" R$25.57
P 2018-01-31 "IRBR3" R$28.24
P 2018-02-28 "IRBR3" R$29.11
P 2018-04-02 "IRBR3" R$31.29
P 2018-04-30 "IRBR3" R$35.58
#+end_example

Specify currency:

#+begin_src sh :dir examples/values/
python=~/.venv/general/bin/python
$python -m investory.values --commodity ^BVSP --begin 2023-01-01 --currency R$
head ^BVSP.ledger
rm -rf ^BVSP.ledger
#+end_src

#+RESULTS:
#+begin_example
P 2023-01-31 "^BVSP" R$113532.000000
P 2023-02-28 "^BVSP" R$104932.000000
P 2023-03-31 "^BVSP" R$101882.000000
P 2023-04-28 "^BVSP" R$104432.000000
P 2023-05-31 "^BVSP" R$108335.000000
P 2023-06-30 "^BVSP" R$118087.000000
P 2023-07-31 "^BVSP" R$121943.000000
P 2023-08-31 "^BVSP" R$115742.000000
P 2023-09-29 "^BVSP" R$116565.000000
P 2023-10-31 "^BVSP" R$113144.000000
#+end_example

With different yahoo ticker than the commodity symbol.
For example we can use € in the ledger but yahoo identifies it as "EURUSD=X".
Or we can use BTC in our ledger but at Yahoo they use "BTC-USD".

#+begin_src sh :dir examples/values/
python=~/.venv/general/bin/python
$python -m investory.values --commodity € --yahooticker EURUSD=X --begin 2023-01-01
head EURUSD=X.ledger
rm -rf EURUSD=X.ledger
#+end_src

#+RESULTS:
#+begin_example
P 2023-01-31 "€" $1.085069
P 2023-02-28 "€" $1.061121
P 2023-03-31 "€" $1.090465
P 2023-04-28 "€" $1.103205
P 2023-05-31 "€" $1.073307
P 2023-06-30 "€" $1.086803
P 2023-07-31 "€" $1.102426
P 2023-08-31 "€" $1.093255
P 2023-09-29 "€" $1.056245
P 2023-10-31 "€" $1.061504
#+end_example

#+begin_src sh :dir examples/values/
python=~/.venv/general/bin/python
$python -m investory.values --commodity BTC --yahooticker BTC-USD --begin 2023-01-01
head BTC-USD.ledger
rm -rf BTC-USD.ledger
#+end_src

#+RESULTS:
#+begin_example
P 2023-01-31 "BTC" $23139.283203
P 2023-02-28 "BTC" $23147.353516
P 2023-03-31 "BTC" $28478.484375
P 2023-04-28 "BTC" $29340.261719
P 2023-05-31 "BTC" $27219.658203
P 2023-06-30 "BTC" $30477.251953
P 2023-07-31 "BTC" $29230.111328
P 2023-08-31 "BTC" $25931.472656
P 2023-09-29 "BTC" $26911.720703
P 2023-10-31 "BTC" $34667.781250
#+end_example
